Werllley007/stm32f103c8t6-sem-cmsis-FreeRTOS/Core/Inc/FreeRTOSConfig.h
/*
    FreeRTOS V9.0.0 - Copyright (C) 2016 Real Time Engineers Ltd.
    All rights reserved

    VISIT http://www.FreeRTOS.org TO ENSURE YOU ARE USING THE LATEST VERSION.

    This file is part of the FreeRTOS distribution.

    FreeRTOS is free software; you can redistribute it and/or modify it under
    the terms of the GNU General Public License (version 2) as published by the
    Free Software Foundation >>>> AND MODIFIED BY <<<< the FreeRTOS exception.

    ***************************************************************************
    >>!   NOTE: The modification to the GPL is included to allow you to     !<<
    >>!   distribute a combined work that includes FreeRTOS without being   !<<
    >>!   obliged to provide the source code for proprietary components     !<<
    >>!   outside of the FreeRTOS kernel.                                   !<<
    ***************************************************************************

    FreeRTOS is distributed in the hope that it will be useful, but WITHOUT ANY
    WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS
    FOR A PARTICULAR PURPOSE.  Full license text is available on the following
    link: http://www.freertos.org/a00114.html

    ***************************************************************************
     *                                                                       *
     *    FreeRTOS provides completely free yet professionally developed,    *
     *    robust, strictly quality controlled, supported, and cross          *
     *    platform software that is more than just the market leader, it     *
     *    is the industry's de facto standard.                               *
     *                                                                       *
     *    Help yourself get started quickly while simultaneously helping     *
     *    to support the FreeRTOS project by purchasing a FreeRTOS           *
     *    tutorial book, reference manual, or both:                          *
     *    http://www.FreeRTOS.org/Documentation                              *
     *                                                                       *
    ***************************************************************************

    http://www.FreeRTOS.org/FAQHelp.html - Having a problem?  Start by reading
    the FAQ page "My application does not run, what could be wrong?".  Have you
    defined configASSERT()?

    http://www.FreeRTOS.org/support - In return for receiving this top quality
    embedded software for free we request you assist our global community by
    participating in the support forum.

    http://www.FreeRTOS.org/training - Investing in training allows your team to
    be as productive as possible as early as possible.  Now you can receive
    FreeRTOS training directly from Richard Barry, CEO of Real Time Engineers
    Ltd, and the world's leading authority on the world's leading RTOS.

    http://www.FreeRTOS.org/plus - A selection of FreeRTOS ecosystem products,
    including FreeRTOS+Trace - an indispensable productivity tool, a DOS
    compatible FAT file system, and our tiny thread aware UDP/IP stack.

    http://www.FreeRTOS.org/labs - Where new FreeRTOS products go to incubate.
    Come and try FreeRTOS+TCP, our new open source TCP/IP stack for FreeRTOS.

    http://www.OpenRTOS.com - Real Time Engineers ltd. license FreeRTOS to High
    Integrity Systems ltd. to sell under the OpenRTOS brand.  Low cost OpenRTOS
    licenses offer ticketed support, indemnification and commercial middleware.

    http://www.SafeRTOS.com - High Integrity Systems also provide a safety
    engineered and independently SIL3 certified version for use in safety and
    mission critical applications that require provable dependability.

    1 tab == 4 spaces!
*/

#ifndef FREERTOS_CONFIG_H
#define FREERTOS_CONFIG_H

/* STM32 Includes */
#include <stm32f1xx.h>
#include <stdint.h>

/* Externs */

extern uint32_t SystemCoreClock;

/*-----------------------------------------------------------
 * Application specific definitions.
 *
 * These definitions should be adjusted for your particular hardware and
 * application requirements.
 *
 * THESE PARAMETERS ARE DESCRIBED WITHIN THE 'CONFIGURATION' SECTION OF THE
 * FreeRTOS API DOCUMENTATION AVAILABLE ON THE FreeRTOS.org WEB SITE.
 *
 * See http://www.freertos.org/a00110.html.
 *----------------------------------------------------------*/

#define configUSE_PREEMPTION						1
#define configUSE_TIME_SLICING                     	1
#define configUSE_PORT_OPTIMISED_TASK_SELECTION    	0
#define configUSE_TICKLESS_IDLE                    	0
#define configUSE_IDLE_HOOK							0
#define configUSE_TICK_HOOK							0
#define configCPU_CLOCK_HZ    						( ( unsigned long ) SystemCoreClock )
//#define configSYSTICK_CLOCK_HZ					( configCPU_CLOCK_HZ / 8 ) /* vTaskDelay() fix */
#define configTICK_RATE_HZ                         	100
#define configMAX_PRIORITIES						( 5 )
#define configMINIMAL_STACK_SIZE					( ( unsigned short ) 128 )
#define configTOTAL_HEAP_SIZE						( ( size_t ) ( 17 * 1024 ) )
#define configMAX_TASK_NAME_LEN						( 16 )
#define configUSE_TRACE_FACILITY					0
#define configUSE_16_BIT_TICKS						0
#define configIDLE_SHOULD_YIELD						1
#define configTASK_NOTIFICATION_ARRAY_ENTRIES      	1
#define configQUEUE_REGISTRY_SIZE                  	0
#define configENABLE_BACKWARD_COMPATIBILITY        	0
#define configNUM_THREAD_LOCAL_STORAGE_POINTERS    	0
#define configUSE_MINI_LIST_ITEM                   	1
#define configUSE_MUTEXES							0
#define configCHECK_FOR_STACK_OVERFLOW				0
#define configCHECK_HANDLER_INSTALLATION			1

#define configSTACK_DEPTH_TYPE                     	size_t
#define configMESSAGE_BUFFER_LENGTH_TYPE           	size_t
#define configHEAP_CLEAR_MEMORY_ON_FREE            	1
#define configSTATS_BUFFER_MAX_LENGTH              	0xFFFF

#define configUSE_EVENT_GROUPS    					1
#define configUSE_STREAM_BUFFERS    				1

/* Co-routine definitions. */
#define configUSE_CO_ROUTINES                    	0
#define configMAX_CO_ROUTINE_PRIORITIES          	( 2 )

#define configUSE_TIMERS                			1
#define configTIMER_TASK_PRIORITY       			( configMAX_PRIORITIES - 1 )
#define configTIMER_QUEUE_LENGTH        			10
#define configTIMER_TASK_STACK_DEPTH    			configMINIMAL_STACK_SIZE

/* The following flag must be enabled only when using newlib */
#define configUSE_NEWLIB_REENTRANT         	 		0

/* Set the following definitions to 1 to include the API function, or zero
to exclude the API function. */
#define INCLUDE_vTaskPrioritySet            		1
#define INCLUDE_uxTaskPriorityGet           		1
#define INCLUDE_vTaskDelete                 		1
#define INCLUDE_vTaskCleanUpResources       		0
#define INCLUDE_vTaskSuspend                		1
#define INCLUDE_vTaskDelayUntil             		1
#define INCLUDE_vTaskDelay                  		1
#define INCLUDE_xTaskGetSchedulerState      		1
#define INCLUDE_xTimerPendFunctionCall      		1
#define INCLUDE_xQueueGetMutexHolder        		1
#define INCLUDE_uxTaskGetStackHighWaterMark 		1
#define INCLUDE_xTaskGetCurrentTaskHandle   		1
#define INCLUDE_eTaskGetState               		1


#define USE_FreeRTOS_HEAP_4

/* Cortex-M specific definitions. */
#ifdef __NVIC_PRIO_BITS
 /* __BVIC_PRIO_BITS will be specified when CMSIS is being used. */
 #define configPRIO_BITS         __NVIC_PRIO_BITS
#else
 #define configPRIO_BITS         4
#endif

/* The lowest interrupt priority that can be used in a call to a "set priority"
function. */
#define configLIBRARY_LOWEST_INTERRUPT_PRIORITY   15

/* The highest interrupt priority that can be used by any interrupt service
routine that makes calls to interrupt safe FreeRTOS API functions.  DO NOT CALL
INTERRUPT SAFE FREERTOS API FUNCTIONS FROM ANY INTERRUPT THAT HAS A HIGHER
PRIORITY THAN THIS! (higher priorities are lower numeric values. */
#define configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY 5

/* Interrupt priorities used by the kernel port layer itself.  These are generic
to all Cortex-M ports, and do not rely on any particular library functions. */
#define configKERNEL_INTERRUPT_PRIORITY 		( configLIBRARY_LOWEST_INTERRUPT_PRIORITY << (8 - configPRIO_BITS) )
/* !!!! configMAX_SYSCALL_INTERRUPT_PRIORITY must not be set to zero !!!!
See http://www.FreeRTOS.org/RTOS-Cortex-M3-M4.html. */
#define configMAX_SYSCALL_INTERRUPT_PRIORITY 	( configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY << (8 - configPRIO_BITS) )

/* Normal assert() semantics without relying on the provision of an assert.h
header file. */
/* USER CODE BEGIN 1 */
#define configASSERT( x ) if ((x) == 0) {taskDISABLE_INTERRUPTS(); for( ;; );}
/* USER CODE END 1 */

/* Definitions that map the FreeRTOS port interrupt handlers to their CMSIS
standard names. */
#define vPortSVCHandler    							SVC_Handler
#define xPortPendSVHandler 							PendSV_Handler
#define xPortSysTickHandler							SysTick_Handler

/* IMPORTANT: After 10.3.1 update, Systick_Handler comes from NVIC (if SYS timebase = systick), otherwise from cmsis_os2.c */

#define USE_CUSTOM_SYSTICK_HANDLER_IMPLEMENTATION 0

/* USER CODE BEGIN Defines */
/* Section where parameter definitions can be added (for instance, to override default ones in FreeRTOS.h) */
/* USER CODE END Defines */

#endif /* FREERTOS_CONFIG_H */
